Repository: CofficLab/Lumi
Catalog: Plugins/EditorPreviewPlugin/Sources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

# ⚠️ Stale keys (%d):
source: \n⚠️ Stale keys (%d):
zh_hans: \n⚠️ 废弃的 key（%d）：
zh_hk: \n⚠️ 廢棄的 key（%d）：

# ⚠️ Untranslated entries for "%@" (%d) — value equals key:
source: \n⚠️ Untranslated entries for "%@" (%d) — value equals key:
zh_hans: \n⚠️ "%@" 未实际翻译（%d）— 值与 key 相同：
zh_hk: \n⚠️ "%@" 未實際翻譯（%d）— 值與 key 相同：

# ✅ No issues found.
source: \n✅ No issues found.
zh_hans: \n✅ 未发现问题。
zh_hk: \n✅ 未發現問題。

# 📊 Total issues: %d (stale: %d, missing: %d, untranslated: %d)
source: \n📊 Total issues: %d (stale: %d, missing: %d, untranslated: %d)
zh_hans: \n📊 问题总数：%1$d（废弃：%2$d，缺失：%3$d，未翻译：%4$d）
zh_hk: \n📊 問題總數：%1$d（廢棄：%2$d，缺失：%3$d，未翻譯：%4$d）

# 🚫 Missing translations for "%@" (%d):
source: \n🚫 Missing translations for "%@" (%d):
zh_hans: \n🚫 "%@" 缺失翻译（%d）：
zh_hk: \n🚫 "%@" 缺失翻譯（%d）：

# %d rows × %d columns
source: %1$d rows × %2$d columns
zh_hans: %1$d 行 × %2$d 列
zh_hk: %1$d 列 × %2$d 欄

source: ✅ Cleaned %lld stale key(s) from %@
zh_hans: ✅ 已从 %2$@ 清理 %1$lld 个废弃的 key
zh_hk: ✅ 已從 %2$@ 清理 %1$lld 個废弃的 key

source: Add to Chat
zh_hans: 添加到对话
zh_hk: 新增至對話

source: Ask AI
zh_hans: 问 AI
zh_hk: 問 AI

source: Ask AI to analyze preview failure
zh_hans: 请 AI 分析预览失败原因
zh_hk: 請 AI 分析預覽失敗原因

source: Ask AI to fix String Catalog issues
zh_hans: 请 AI 修复字符串目录问题
zh_hk: 請 AI 修復字串目錄問題

source: Ask AI to fix translation issues
zh_hans: 让 AI 修复翻译问题
zh_hk: 讓 AI 修復翻譯問題

source: Build log saved:
zh_hans: 构建日志已保存：
zh_hk: 建置日誌已儲存：

source: building %@
zh_hans: 正在构建 %@
zh_hk: 正在建置 %@

source: cache
zh_hans: 缓存
zh_hk: 快取

source: Cancel
zh_hans: 取消
zh_hk: 取消

source: Choose which #Preview in the current Swift file to build and render.
zh_hans: 选择当前 Swift 文件中要构建和渲染的 #Preview。
zh_hk: 選擇當前 Swift 檔案中要建置和渲染的 #Preview。

source: Clean all stale String Catalog keys in this project?
zh_hans: 清理此项目中所有过期的字符串目录键？
zh_hk: 清理此專案中所有過期的字串目錄鍵？

source: Clean Project String Catalogs
zh_hans: 清理项目字符串目录
zh_hk: 清理專案字串目錄

source: Clean stale keys in every String Catalog file in the current project
zh_hans: 清理当前项目中每个字符串目录文件的过期键
zh_hk: 清理當前專案中每個字串目錄檔案的過期鍵

source: Clean stale keys in the current String Catalog file
zh_hans: 清理当前字符串目录文件中的过期键
zh_hk: 清理當前字串目錄檔案中的過期鍵

source: Clear Inline Preview build cache
zh_hans: 清除内联预览构建缓存
zh_hk: 清除內嵌預覽建置快取

source: Compilation failed
zh_hans: 编译失败
zh_hk: 編譯失敗

source: Copied
zh_hans: 已复制
zh_hk: 已複製

source: Copy
zh_hans: 复制
zh_hk: 複製

source: Copy error message to clipboard
zh_hans: 复制错误信息到剪贴板
zh_hk: 複製錯誤訊息到剪貼簿

source: CSV Preview
zh_hans: CSV 预览
zh_hk: CSV 預覽

source: Default Localization
zh_hans: 默认本地化
zh_hk: 預設本地化

source: Default Localization (%@)
zh_hans: 默认本地化 (%@)
zh_hk: 預設本地化 (%@)

source: Delete
zh_hans: 删除
zh_hk: 刪除

source: Dependency planning failed
zh_hans: 依赖规划失败
zh_hk: 依賴規劃失敗

source: Editor service is not available.
zh_hans: 编辑器服务不可用。
zh_hk: 編輯器服務不可用。

source: Embedded preview powered by LumiPreviewKit
zh_hans: 由 LumiPreviewKit 驱动的内嵌预览
zh_hk: 由 LumiPreviewKit 驅動的內嵌預覽

source: Empty CSV data
zh_hans: 空的 CSV 数据
zh_hk: 空的 CSV 資料

source: Entry debug state
zh_hans: 条目调试状态
zh_hk: 條目除錯狀態

source: Error: failed to clean string catalog: %@
zh_hans: 错误：清理字符串目录失败：%@
zh_hk: 錯誤：清理字串目錄失敗：%@

source: Error: failed to parse xcstrings file: %@
zh_hans: 错误：解析 xcstrings 文件失败：%@
zh_hk: 錯誤：解析 xcstrings 檔案失敗：%@

source: Error: failed to read file: %@
zh_hans: 错误：读取文件失败：%@
zh_hk: 錯誤：讀取檔案失敗：%@

source: Error: failed to write cleaned content: %@
zh_hans: 错误：写入清理后的内容失败：%@
zh_hk: 錯誤：寫入清理後的內容失敗：%@

source: Error: file is not an xcstrings file: %@
zh_hans: 错误：文件不是 xcstrings 格式：%@
zh_hk: 錯誤：檔案不是 xcstrings 格式：%@

source: Error: file not found: %@
zh_hans: 错误：未找到文件：%@
zh_hk: 錯誤：未找到檔案：%@

source: Error: file_path is required
zh_hans: 错误：file_path 参数为必填
zh_hk: 錯誤：file_path 參數為必填

source: Failed to capture preview screenshot.
zh_hans: 截图预览失败。
zh_hk: 截圖預覽失敗。

source: Failed to clean project String Catalogs: %@
zh_hans: 清理项目字符串目录失败：%@
zh_hk: 清理專案字串目錄失敗：%@

source: Failed to clean String Catalog: %@
zh_hans: 清理字符串目录失败：%@
zh_hk: 清理字串目錄失敗：%@

source: Failed to load image: %@
zh_hans: 加载图片失败：%@
zh_hk: 載入圖片失敗：%@

source: Failed to load string catalog: %@
zh_hans: 加载字符串目录失败：%@
zh_hk: 載入字串目錄失敗：%@

source: Failed to save file: %@
zh_hans: 保存文件失败：%@
zh_hk: 儲存檔案失敗：%@

source: Failed to save file.
zh_hans: 保存文件失败。
zh_hk: 儲存檔案失敗。

source: Failed to save screenshot: %@
zh_hans: 保存截图失败：%@
zh_hk: 儲存截圖失敗：%@

source: failed: %@
zh_hans: 失败：%@
zh_hk: 失敗：%@

source: File not found: %@
zh_hans: 文件未找到：%@
zh_hk: 檔案未找到：%@

source: File saved to Downloads: %@
zh_hans: 文件已保存到下载：%@
zh_hk: 檔案已儲存到下載項目：%@

source: File: %@\nSource language: %@ | Languages: %d | Active entries: %d | Stale Entries: %d
zh_hans: 文件：%1$@\n源语言：%2$@ | 语言数：%3$d | 有效条目：%4$d | 废弃条目：%5$d
zh_hk: 檔案：%1$@\n源語言：%2$@ | 語言數：%3$d | 有效條目：%4$d | 廢棄條目：%5$d

source: HTML Preview
zh_hans: HTML 预览
zh_hk: HTML 預覽

source: Image Preview
zh_hans: 图片预览
zh_hk: 圖片預覽

source: Inline Preview
zh_hans: 内联预览
zh_hk: 內嵌預覽

source: Invalid CSV
zh_hans: 无效的 CSV
zh_hk: 無效的 CSV

source: Invalid JSON
zh_hans: 无效的 JSON
zh_hk: 無效的 JSON

source: Invalid JSON data
zh_hans: 无效的 JSON 数据
zh_hk: 無效的 JSON 資料

source: Invalid JSONL at line %lld
zh_hans: 第 %lld 行 JSONL 格式无效
zh_hk: 第 %lld 行 JSONL 格式無效

source: Invalid plist
zh_hans: 无效的 plist
zh_hk: 無效的 plist

source: Invalid plist data
zh_hans: 无效的 plist 数据
zh_hk: 無效的 plist 資料

source: JSON Preview
zh_hans: JSON 预览
zh_hk: JSON 預覽

source: Key
zh_hans: 键
zh_hk: 鍵

source: Markdown Preview
zh_hans: Markdown 预览
zh_hk: Markdown 預覽

source: Markdown TODO completion
zh_hans: Markdown 待办补全
zh_hk: Markdown 待辦補全

source: No #Preview in the current Swift file.
zh_hans: 当前 Swift 文件中没有 #Preview。
zh_hk: 當前 Swift 檔案中沒有 #Preview。

source: No CSV content to preview.
zh_hans: 没有可预览的 CSV 内容。
zh_hk: 沒有可預覽的 CSV 內容。

source: No data rows found
zh_hans: 未找到数据行
zh_hk: 未找到資料行

source: No JSON content to preview.
zh_hans: 没有可预览的 JSON 内容。
zh_hk: 沒有可預覽的 JSON 內容。

source: No Markdown content to preview.
zh_hans: 没有可预览的 Markdown 内容。
zh_hk: 沒有可預覽的 Markdown 內容。

source: No plist content to preview.
zh_hans: 没有可预览的 plist 内容。
zh_hk: 沒有可預覽的 plist 內容。

source: No stale keys found in the string catalog.
zh_hans: 字符串目录中未发现废弃的 key。
zh_hk: 字串目錄中未發現废弃的 key。

source: No stale String Catalog keys found.
zh_hans: 未发现过期的字符串目录键。
zh_hk: 未發現過期的字串目錄鍵。

source: No String Catalog content to preview.
zh_hans: 没有可预览的字符串目录内容。
zh_hk: 沒有可預覽的字串目錄內容。

source: Open a Swift file with a `#Preview`, an image, Markdown, JSON, or String Catalog file to preview it here.
zh_hans: 打开包含 #Preview 的 Swift 文件、图片、Markdown、JSON 或字符串目录文件以在此预览。
zh_hk: 開啟包含 #Preview 的 Swift 檔案、圖片、Markdown、JSON 或字串目錄檔案以在此預覽。

source: Open a Swift file with a `#Preview`; Inline Preview starts automatically and refreshes when you save.
zh_hans: 打开包含 #Preview 的 Swift 文件；内联预览会自动启动并在保存时刷新。
zh_hk: 開啟包含 #Preview 的 Swift 檔案；內嵌預覽會自動啟動並在儲存時重新整理。

source: PDF Preview
zh_hans: PDF 预览
zh_hk: PDF 預覽

source: Please analyze whether this Swift #Preview failure is caused by a Lumi bug or a problem in the current project, and explain how to fix it:
zh_hans: 请分析这次 Swift #Preview 预览失败是 Lumi 的 bug 还是当前项目的问题，并说明如何修复：
zh_hk: 請分析這次 Swift #Preview 預覽失敗是 Lumi 的 bug 還是當前專案的問題，並說明如何修復：

source: Plist Preview
zh_hans: Plist 预览
zh_hk: Plist 預覽

source: Preview
zh_hans: 预览
zh_hk: 預覽

source: Preview dylib failed to load
zh_hans: 预览动态库加载失败
zh_hk: 預覽動態庫載入失敗

source: Preview failed
zh_hans: 预览失败
zh_hk: 預覽失敗

source: ready
zh_hans: 就绪
zh_hk: 就緒

source: rebuilt
zh_hans: 已重新构建
zh_hk: 已重新建置

source: Refresh entry debug state
zh_hans: 刷新条目调试状态
zh_hk: 重新整理條目除錯狀態

source: Remove Stale Key
zh_hans: 移除过期键
zh_hk: 移除過期鍵

# Removed %d stale key(s) from %d String Catalog file(s).
source: Removed %1$d stale key(s) from %2$d String Catalog file(s).
zh_hans: 已从 %2$d 个字符串目录文件中移除 %1$d 个过期键。
zh_hk: 已從 %2$d 個字串目錄檔案中移除 %1$d 個過期鍵。

source: Removed %d stale String Catalog key(s).
zh_hans: 已移除 %d 个过期的字符串目录键。
zh_hk: 已移除 %d 個過期的字串目錄鍵。

source: Retry
zh_hans: 重试
zh_hk: 重試

source: Retry preview build
zh_hans: 重试预览构建
zh_hk: 重試預覽建置

source: running · %@
zh_hans: 运行中 · %@
zh_hk: 執行中 · %@

source: Scanned %d String Catalog file(s); no stale keys found.
zh_hans: 已扫描 %d 个字符串目录文件；未发现过期键。
zh_hk: 已掃描 %d 個字串目錄檔案；未發現過期鍵。

source: Screenshot preview canvas
zh_hans: 截图预览画布
zh_hk: 截圖預覽畫布

source: Screenshot saved to Downloads and copied to clipboard: %@
zh_hans: 截图已保存到下载并复制到剪贴板：%@
zh_hk: 截圖已儲存到下載項目並複製到剪貼簿：%@

source: SDK resolution failed
zh_hans: SDK 解析失败
zh_hk: SDK 解析失敗

source: Select a project before cleaning String Catalogs.
zh_hans: 清理字符串目录前请先选择项目。
zh_hk: 清理字串目錄前請先選擇專案。

source: Show entry debug state
zh_hans: 显示条目调试状态
zh_hk: 顯示條目除錯狀態

source: Show log file in Finder
zh_hans: 在 Finder 中显示日志文件
zh_hk: 在 Finder 中顯示日誌檔案

source: Stale String Catalog keys in the current file
zh_hans: 当前文件中过期的字符串目录键
zh_hk: 當前檔案中過期的字串目錄鍵

source: starting
zh_hans: 正在启动
zh_hk: 正在啟動

source: stopping
zh_hans: 正在停止
zh_hk: 正在停止

source: String Catalog Preview
zh_hans: 字符串目录预览
zh_hk: 字串目錄預覽

source: This file type is not supported by Inline Preview yet.
zh_hans: 内联预览尚不支持此文件类型。
zh_hk: 內嵌預覽尚不支援此檔案類型。

source: This rewrites every .xcstrings file under the current project and removes entries marked as stale.
zh_hans: 这将重写当前项目下的所有 .xcstrings 文件并移除标记为过期的条目。
zh_hk: 這將重寫當前專案下的所有 .xcstrings 檔案並移除標記為過期的條目。

source: TOC
zh_hans: 目录
zh_hk: 目錄

source: Unclosed quoted field
zh_hans: 未关闭的引号字段
zh_hk: 未關閉的引號欄位

source: Unsupported plist format
zh_hans: 不支持的 plist 格式
zh_hk: 不支援的 plist 格式

source: warming
zh_hans: 预热中
zh_hk: 預熱中
